Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD20_DFP/3.4.61/samd20b/edc/ATSAMD20G15B.PIC
      <edc:SFRDef edc:_addr="0x4000041C" edc:access="----------------------------nnnn" edc:cname="APBBMASK" edc:impl="0xF" edc:mclr="00000000000000000000000000011111" edc:nzwidth="0x20" edc:por="00000000000000000000000000011111" ltx:memberofperipheral="PM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="PAC1_" edc:desc="PAC1 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSU_" edc:desc="DSU APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVMCTRL_" edc:desc="NVMCTRL APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PORT_" edc:desc="PORT APB Clock Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000420" edc:access="------------nnnn--nnnnnnnnnnnnnn" edc:cname="APBCMASK" edc:impl="0xF3FFF" edc:mclr="00000000000000010000000000000000" edc:nzwidth="0x20" edc:por="00000000000000010000000000000000" ltx:memberofperipheral="PM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="PAC2_" edc:desc="PAC2 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVSYS_" edc:desc="EVSYS APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM0_" edc:desc="SERCOM0 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM1_" edc:desc="SERCOM1 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM2_" edc:desc="SERCOM2 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM3_" edc:desc="SERCOM3 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM4_" edc:desc="SERCOM4 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM5_" edc:desc="SERCOM5 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC0_" edc:desc="TC0 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC1_" edc:desc="TC1 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC2_" edc:desc="TC2 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC3_" edc:desc="TC3 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC4_" edc:desc="TC4 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC5_" edc:desc="TC5 APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="ADC_" edc:desc="ADC APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AC_" edc:desc="AC APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DAC_" edc:desc="DAC APB Clock Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTC_" edc:desc="PTC APB Clock Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40000424" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x40000434" edc:access="-------n" edc:cname="INTENCLR" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="CKRDY" edc:desc="Clock Ready Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000435" edc:access="-------n" edc:cname="INTENSET" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="CKRDY" edc:desc="Clock Ready Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000436" edc:access="-------n" edc:cname="INTFLAG" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="CKRDY" edc:desc="Clock Ready" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40000437" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x40000438" edc:access="-rrr-rrr" edc:cname="RCAUSE" edc:impl="0x77" edc:mclr="00000001" edc:nzwidth="0x8" edc:por="00000001" ltx:memberofperipheral="PM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PM">
            <edc:SFRFieldDef edc:cname="POR" edc:desc="Power On Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOD12" edc:desc="Brown Out 12 Detector Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOD33" edc:desc="Brown Out 33 Detector Reset" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EXT" edc:desc="External Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDT" edc:desc="Watchdog Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SYST" edc:desc="System Reset Request" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40000439" edc:offset="0x3C7"/>
      <edc:SFRDef edc:_addr="0x40000800" edc:access="--------------------nnnnnnnnnnnn" edc:cname="INTENCLR" edc:impl="0xFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SYSCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SYSCTRL">
            <edc:SFRFieldDef edc:cname="XOSCRDY" edc:desc="XOSC Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="XOSC32KRDY" edc:desc="XOSC32K Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSC32KRDY" edc:desc="OSC32K Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSC8MRDY" edc:desc="OSC8M Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLRDY" edc:desc="DFLL Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLOOB" edc:desc="DFLL Out Of Bounds" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKF" edc:desc="DFLL Lock Fine" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKC" edc:desc="DFLL Lock Coarse" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLRCS" edc:desc="DFLL Reference Clock Stopped" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOD33RDY" edc:desc="BOD33 Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOD33DET" edc:desc="BOD33 Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="B33SRDY" edc:desc="BOD33 Synchronization Ready" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000804" edc:access="--------------------nnnnnnnnnnnn" edc:cname="INTENSET" edc:impl="0xFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SYSCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SYSCTRL">
            <edc:SFRFieldDef edc:cname="XOSCRDY" edc:desc="XOSC Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="XOSC32KRDY" edc:desc="XOSC32K Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSC32KRDY" edc:desc="OSC32K Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSC8MRDY" edc:desc="OSC8M Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLRDY" edc:desc="DFLL Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLOOB" edc:desc="DFLL Out Of Bounds" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKF" edc:desc="DFLL Lock Fine" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKC" edc:desc="DFLL Lock Coarse" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLRCS" edc:desc="DFLL Reference Clock Stopped" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOD33RDY" edc:desc="BOD33 Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOD33DET" edc:desc="BOD33 Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="B33SRDY" edc:desc="BOD33 Synchronization Ready" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000808" edc:access="--------------------nnnnnnnnnnnn" edc:cname="INTFLAG" edc:impl="0xFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SYSCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SYSCTRL">
            <edc:SFRFieldDef edc:cname="XOSCRDY" edc:desc="XOSC Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="XOSC32KRDY" edc:desc="XOSC32K Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSC32KRDY" edc:desc="OSC32K Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSC8MRDY" edc:desc="OSC8M Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLRDY" edc:desc="DFLL Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLOOB" edc:desc="DFLL Out Of Bounds" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKF" edc:desc="DFLL Lock Fine" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKC" edc:desc="DFLL Lock Coarse" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLRCS" edc:desc="DFLL Reference Clock Stopped" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOD33RDY" edc:desc="BOD33 Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOD33DET" edc:desc="BOD33 Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="B33SRDY" edc:desc="BOD33 Synchronization Ready" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000080C" edc:access="--------------------rrrrrrrrrrrr" edc:cname="PCLKSR" edc:impl="0xFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SYSCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SYSCTRL">
            <edc:SFRFieldDef edc:cname="XOSCRDY" edc:desc="XOSC Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="XOSC32KRDY" edc:desc="XOSC32K Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSC32KRDY" edc:desc="OSC32K Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSC8MRDY" edc:desc="OSC8M Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLRDY" edc:desc="DFLL Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLOOB" edc:desc="DFLL Out Of Bounds" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKF" edc:desc="DFLL Lock Fine" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLLCKC" edc:desc="DFLL Lock Coarse" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLRCS" edc:desc="DFLL Reference Clock Stopped" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOD33RDY" edc:desc="BOD33 Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOD33DET" edc:desc="BOD33 Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="B33SRDY" edc:desc="BOD33 Synchronization Ready" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000810" edc:access="nnnnnnnnnn---nn-" edc:cname="XOSC" edc:impl="0xFFC6" edc:mclr="0000000010000000" edc:nzwidth="0x10" edc:por="0000000010000000" ltx:memberofperipheral="SYSCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SYSCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Oscillator Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="XTALEN" edc:desc="Crystal Oscillator Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:desc="On Demand Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GAIN" edc:desc="Oscillator Gain" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="0" edc:desc="2MHz" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="1" edc:desc="4MHz" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="2" edc:desc="8MHz" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="3" edc:desc="16MHz" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="4" edc:desc="30MHz" edc:when="(field &amp; 0x7) == 0x4"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="AMPGC" edc:desc="Automatic Amplitude Gain Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STARTUP" edc:desc="Start-Up Time" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="CYCLE1" edc:desc="31 us" edc:when="(field &amp; 0xF) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE2" edc:desc="61 us" edc:when="(field &amp; 0xF) == 1"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE4" edc:desc="122 us" edc:when="(field &amp; 0xF) == 2"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE8" edc:desc="244 us" edc:when="(field &amp; 0xF) == 3"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE16" edc:desc="488 us" edc:when="(field &amp; 0xF) == 4"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE32" edc:desc="977 us" edc:when="(field &amp; 0xF) == 5"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE64" edc:desc="1953 us" edc:when="(field &amp; 0xF) == 6"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE128" edc:desc="3906 us" edc:when="(field &amp; 0xF) == 7"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE256" edc:desc="7813 us" edc:when="(field &amp; 0xF) == 8"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE512" edc:desc="15625 us" edc:when="(field &amp; 0xF) == 9"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE1024" edc:desc="31250 us" edc:when="(field &amp; 0xF) == 10"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE2048" edc:desc="62500 us" edc:when="(field &amp; 0xF) == 11"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE4096" edc:desc="125000 us" edc:when="(field &amp; 0xF) == 12"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE8192" edc:desc="250000 us" edc:when="(field &amp; 0xF) == 13"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE16384" edc:desc="500000 us" edc:when="(field &amp; 0xF) == 14"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE32768" edc:desc="1000000 us" edc:when="(field &amp; 0xF) == 15"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40000812" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x40000814" edc:access="---n-nnnnnnnnnn-" edc:cname="XOSC32K" edc:impl="0x17FE" edc:mclr="0000000010000000" edc:nzwidth="0x10" edc:por="0000000010000000" ltx:memberofperipheral="SYSCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SYSCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Oscillator Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="XTALEN" edc:desc="Crystal Oscillator Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EN32K" edc:desc="32kHz Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EN1K" edc:desc="1kHz Output Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AAMPEN" edc:desc="Automatic Amplitude Control Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:desc="On Demand Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STARTUP" edc:desc="Oscillator Start-Up Time" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="CYCLE1" edc:desc="0.122 ms" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE32" edc:desc="1.068 ms" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE2048" edc:desc="62.592 ms" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE4096" edc:desc="125.092 ms" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE16384" edc:desc="500.092 ms" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE32768" edc:desc="1000.092 ms" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE65536" edc:desc="2000.092 ms" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="CYCLE131072" edc:desc="4000.092 ms" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:desc="Write Lock" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
